using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace C_Course_Popov
{
    //Модуль 40. Делегаты.Видеокурс по C#

    // Делегати представляють такі обєкти, які вказують на методи. Тобто по суті, делегати - це квказівники на методи
    // делгати можемо визначати всередині класу, так і поза класом, визначаючи в просторі імен
    // делегат визначає новий тип і може бути створений обект цього типу

    delegate void Message();       // для визначення делекату використовують ключове слово delegate, далі вказується тип, який буде повертатися, далі назва делегату, і в дужках вказуються параметри делегату, які будуть прийматися.
                                   // такому делегату Message - будуть відповідати всі методи, які мають тип повернення void, і не приймають ніякі параметри.

    delegate int Opperation(int x, int y);

   
}


