using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace C_Course_Popov
{
    // Модуль 25. Константы и поля для чтения в языке программирования C#

    class MathLib
    {
        // Константы

        public const int T = 67;  // як правило назва константи  визначається у верхньому регістрі. Значення константи має бути встановлено до компіляції
                                  // так як константа фактично предятавляє собою статичне поле. Тобто значення, яке буде загальним для всіх обєктів класу MathLib, тому до цього значення ми можемо звретатися по імені класу.


        // -- поля для чтения --

        // значення поля для читання також встановлюється тільки один раз, за виключенням одного випадку - за виключенням констуртора

        public readonly int p = 89;   // поле для читання

        public MathLib()
        {
            p = 102;
        }

    }
}
